[
    {
  "id": 1,
  "logo": "course_thumb01.jpg",
  "courseTitle": "Mastering HTML5 and CSS3 for Responsive Web Design",
  "category": "Frontend",
  "instructor": "Kiran Molly",
  "price": "premium",
  "language": "English",
  "difficulty": "Beginner",
  "rating": "4.8",
  "decription1": "The “Mastering HTML5 and CSS3 for Responsive Web Design” course at KP Technologies is designed to build a solid foundation in front-end development. Whether you are a complete beginner or someone looking to refine your web design skills, this course offers a comprehensive understanding of how websites are structured and styled using the latest standards in HTML5 and CSS3. It’s an ideal start for those aiming to become full-stack or front-end developers.",
  "decription3": "At KP Technologies, we believe in practical, hands-on learning. Throughout this course, students will work on live projects, gain experience using tools like VS Code, GitHub, and Chrome Developer Tools, and master industry practices for responsive design. They’ll also be introduced to modern design workflows, including Figma-to-HTML conversion and mobile optimization strategies.",
  "decription4": "Upon completing this course, students will be well-prepared to start their careers as Front-End Developers or UI Designers. Our placement support includes resume building, mock interviews, and job connections with our partner companies. Whether you're a student, job-seeker, or a career switcher, this course is your gateway to entering the professional world of web design with confidence.",
  "learn1": "Semantic HTML5 Structure",
  "learn2": "CSS3 Styling Techniques",
  "learn3": "Responsive Web Design with Media Queries",
  "learn4": "Flexbox Layout System",
  "learn5": "CSS Grid Layout",
  "learn6": "Mobile-First Design Approach",
  "learn7": "HTML5 Forms and Validations",
  "learn8": "CSS Transitions and Animations",
  "learn9": "Cross-Browser Compatibility",
  "learn10": "Debugging with Chrome DevTools",
  "learn11": "Live Project Development",
  "learn12": "Website Hosting & Deployment Basics",
  "duration":"3 Months"
},

    {
        "id": 2,
        "logo": "course_thumb02.jpg",
        "courseTitle": "Modern JavaScript ES6+ Projects from Scratch to Expert",
        "category": "Frontend",
        "instructor": "Jackson Alive",
        "price": "premium",
        "language": "spanish",
        "difficulty": "intermediate",
        "rating": "intermediate",
         "decription1": "Master Modern JavaScript (ES6+) with Real Projects in Just 3 Months at KP Technologies This course is designed to help students, job seekers, and developers gain expert-level knowledge in JavaScript using modern ES6+ features. Over 3 months, you'll not only learn the syntax and functionality of JavaScript but also understand how to apply these concepts to real-world problems by building hands-on projects. We start from the basics and gradually cover advanced topics like async/await, modular JavaScript, and working with REST APIs.",
        "decription3": "Through carefully structured modules and a project-based learning approach, you’ll create 8–10 real-life applications such as a Weather App, To-Do List, Movie Search App, E-commerce Cart, and more. Each project focuses on a different core concept like DOM manipulation, API integration, data persistence with localStorage, and dynamic UI rendering. These projects are designed to make your portfolio stand out and help you become job-ready.",
        "decription4": "At KP Technologies, we ensure practical learning with expert mentorship, live project guidance, and placement support. This 3-month course is ideal for those aiming to become frontend developers or enhance their full stack capabilities. By the end of the course, you will be confident in building modern, interactive web applications using JavaScript and will have a strong foundation to move into frameworks like React or Angular.",
        "learn1": "Modern JavaScript Syntax (ES6+)",
        "learn2": "DOM Manipulation and Event Handling",
        "learn3": "Asynchronous Programming with Promises and Async/Await",
        "learn4": "Working with APIs using Fetch",
        "learn5": "LocalStorage & SessionStorage for Data Persistence",
        "learn6": "Creating Real-World Projects (To-Do App, Weather App, etc.)",
        "learn7": "Modular JavaScript using Import/Export",
        "learn8": "Reusable Components and ES6 Classes",
        "learn9": "Error Handling and Debugging Techniques",
        "learn10": "Working with JSON and Dynamic Data",
        "learn11": "Code Structuring and Clean Coding Practices",
        "learn12": "Project Deployment & GitHub Hosting",
        "duration":"3 Months"
    },
    {
        "id": 3,
        "logo": "course_thumb03.jpg",
        "courseTitle": "Build Scalable Apps Using TypeScript with Real Projects",
        "category": "Frontend",
        "instructor": "Oawe Alve",
        "price": "premium",
        "language": "china",
        "difficulty": "intermediate",
        "rating": "intermediate",
        "decription1": "Learn TypeScript from scratch and become proficient in building scalable and maintainable applications in just 3 months at KP Technologies. This course is designed for students, aspiring developers, and working professionals who want to enhance their coding with the power of static typing and modern programming practices. You’ll explore TypeScript fundamentals, advanced types, object-oriented programming, and integration with real-world frontend and backend projects.",
        "decription3": "Through a structured curriculum and hands-on approach, you’ll work on multiple real-world applications using TypeScript, such as a Task Manager, Product Inventory System, API-integrated Dashboard, and more. Each project is focused on mastering core TypeScript features like interfaces, generics, enums, modules, and type-safe APIs. These projects will help sharpen your problem-solving skills and build a strong portfolio for job applications.",
        "decription4": "At KP Technologies, we emphasize project-based learning, industry-relevant curriculum, and job-oriented outcomes. This 3-month course ensures expert guidance, live coding sessions, and practical exposure to TypeScript in real development environments. By the end of the course, you will be able to confidently build type-safe, scalable, and production-ready applications, while preparing for roles in modern frontend and full stack development.",
        "learn1": "TypeScript Fundamentals and Static Typing",
        "learn2": "Type Annotations, Interfaces, and Type Aliases",
        "learn3": "Working with Classes, Enums, and Generics",
        "learn4": "Type-Safe Functions and Arrow Functions",
        "learn5": "Object-Oriented Programming with TypeScript",
        "learn6": "Modules and Code Reusability",
        "learn7": "Integrating TypeScript with JavaScript Projects",
        "learn8": "Building Real-World Projects Using TypeScript",
        "learn9": "Error Handling and Type Guards",
        "learn10": "Using TypeScript with React or Angular",
        "learn11": "Working with APIs in TypeScript",
        "learn12": "Compiling, Debugging, and Project Deployment",
        "duration":"3 Months"

    },
    {
        "id": 4,
        "logo": "course_thumb04.jpg",
        "courseTitle": "React.js for Web Developers: Hooks, Context and APIs",
        "category": "Frontend",
        "instructor": "Liakon Rivey",
        "price": "premium",
        "language": "spanish",
        "difficulty": "beginner",
        "rating": "beginner",
         "decription1": "Learn how to build powerful, dynamic web applications using React.js in just 3 months at KP Technologies. This course is perfect for web developers, students, and professionals who want to master modern React development using hooks, context API, and real-world API integrations. Starting with component basics, you'll progress to advanced topics like state management, routing, and reusable architecture.",
        "decription3": "With a project-based learning approach, you will build interactive single-page applications (SPAs) like a Blog App, E-commerce Store, Movie Search App, and more. Each project will focus on core concepts like React hooks (useState, useEffect, useContext), component lifecycle, API integration using Fetch or Axios, and performance optimization strategies.",
        "decription4": "At KP Technologies, our React.js course includes live projects, expert mentorship, and placement guidance. In just 3 months, you'll be ready to build production-ready applications using React.js with modern practices. Whether you're preparing for a frontend developer role or upskilling for freelancing, this course will make your resume stand out.",
         "learn1": "Core Concepts of React.js – Components, JSX, and Props",
        "learn2": "State Management with useState and useReducer",
        "learn3": "Side Effects Handling using useEffect",
        "learn4": "Global State with Context API",
        "learn5": "Routing with React Router",
        "learn6": "API Integration using Fetch and Axios",
        "learn7": "Building Real Projects like Blog, E-commerce, and Dashboards",
        "learn8": "Form Handling and Input Validation",
        "learn9": "Code Splitting and Lazy Loading",
        "learn10": "Reusable Component Architecture",
        "learn11": "Deployment of React Apps to GitHub or Netlify",
        "learn12": "React Dev Tools and Performance Optimization",
        "duration":"3 Months"
    },
    {
        "id": 5,
        "logo": "course_thumb05.jpg",
        "courseTitle": "Next.js Crash Course: Full-Stack Web App Development",
        "category": "Frontend",
        "instructor": "Foley Patrik",
        "price": "free",
        "language": "spanish",
        "difficulty": "expert",
        "rating": "expert",
        "decription1": "Learn how to build powerful, full-stack web applications using Next.js in just 3 months at KP Technologies. This course is ideal for web developers, students, and professionals looking to master server-rendered React apps with cutting-edge performance and SEO capabilities. Starting from the fundamentals, you'll dive deep into advanced topics like dynamic routing, API creation, and full-stack integration.",
         "decription3": "With a project-based learning approach, you will build full-stack applications like a Blog Platform, Product Listing App, Authenticated Dashboard, and more. Each project focuses on key concepts such as file-based routing, server-side rendering (SSR), static site generation (SSG), API routes, and connecting to databases like MongoDB or PostgreSQL.",
        "decription4": "At KP Technologies, our Next.js course includes live project implementation, mentorship from industry experts, and placement support. Within 3 months, you'll gain the skills to build scalable, SEO-friendly web apps using Next.js. Whether you're aiming for a full-stack developer role or enhancing your freelancing profile, this course will make your portfolio stand out.",
        "learn1": "Core Concepts of Next.js – Pages, Components, and Routing",
        "learn2": "Dynamic Routing and File-based Navigation",
        "learn3": "Server-Side Rendering (SSR) and Static Site Generation (SSG)",
        "learn4": "API Routes and Backend Integration within Next.js",
        "learn5": "Using React Hooks with Next.js – useState, useEffect, and useContext",
        "learn6": "Connecting to Databases using Prisma or MongoDB",
        "learn7": "Building Real Projects like Blog, E-commerce, and Dashboards",
        "learn8": "Authentication with NextAuth and JWT",
        "learn9": "Code Splitting, Image Optimization, and Lazy Loading",
        "learn10": "Creating Reusable Layouts and Component Structure",
        "learn11": "Deployment on Vercel and GitHub Integration",
        "learn12": "SEO Optimization, Metadata, and Performance Tuning",
        "duration":"3 Months"

    },
     {
        "id": 6,
        "logo": "course_thumb06.jpg",
        "courseTitle": "Angular Mastery: Build Real-World Apps with Angular 17",
        "category": "Frontend",
        "instructor": "Jackson Alive",
        "price": "premium",
        "language": "china",
        "difficulty": "intermediate",
        "rating": "intermediate",
        "decription1": "Kickstart your frontend development journey with Vue.js at KP Technologies. This beginner-friendly course is designed for students, aspiring developers, and professionals who want to master the fundamentals of Vue.js for building dynamic and interactive single-page applications (SPAs). You'll start with basic concepts like directives, templating, and data binding, and gradually move towards component-driven development.",
  
        "decription3": "The course takes a hands-on, project-based approach where you’ll build real-world applications such as a To-Do App, Weather Dashboard, Blog Platform, and Product Listing App. Each project reinforces essential Vue.js features like Vue CLI, reactive data handling, component composition, props, event handling, and lifecycle hooks.",
        
        "decription4": "At KP Technologies, the Vue.js course comes with live project work, mentorship from experienced trainers, and interview preparation. In just 3 months, you'll become proficient in Vue.js and ready to create production-ready SPAs. Whether you're preparing for a frontend job, freelancing, or personal projects, this course provides a strong foundation in Vue development.",
        
        "learn1": "Core Vue.js Concepts – Directives, Templating, and Data Binding",
        "learn2": "Working with Vue CLI and Project Structure",
        "learn3": "Creating and Managing Components",
        "learn4": "Passing Data with Props and Emitting Events",
        "learn5": "Using Computed Properties and Watchers",
        "learn6": "State Management with Vue's Reactive System",
        "learn7": "Building Projects like To-Do List, Weather App, and Blog",
        "learn8": "Form Handling and Validation",
        "learn9": "Routing with Vue Router for SPA Navigation",
        "learn10": "Vue Lifecycle Hooks and Performance Tips",
        "learn11": "Deploying Vue Apps on Netlify and GitHub Pages",
        "learn12": "Introduction to Vue DevTools and Debugging Techniques",
        "duration":"3 Months"


    },
    {
        "id": 7,
        "logo": "course_thumb06.jpg",
        "courseTitle": "Vue.js for Beginners: Build Dynamic Single Page Apps",
        "category": "Frontend",
        "instructor": "Jackson Alive",
        "price": "premium",
        "language": "china",
        "difficulty": "intermediate",
        "rating": "intermediate",
        "decription1": "Kickstart your frontend development journey with Vue.js at KP Technologies. This beginner-friendly course is designed for students, aspiring developers, and professionals who want to master the fundamentals of Vue.js for building dynamic and interactive single-page applications (SPAs). You'll start with basic concepts like directives, templating, and data binding, and gradually move towards component-driven development.",
  
        "decription3": "The course takes a hands-on, project-based approach where you’ll build real-world applications such as a To-Do App, Weather Dashboard, Blog Platform, and Product Listing App. Each project reinforces essential Vue.js features like Vue CLI, reactive data handling, component composition, props, event handling, and lifecycle hooks.",
        
        "decription4": "At KP Technologies, the Vue.js course comes with live project work, mentorship from experienced trainers, and interview preparation. In just 3 months, you'll become proficient in Vue.js and ready to create production-ready SPAs. Whether you're preparing for a frontend job, freelancing, or personal projects, this course provides a strong foundation in Vue development.",
        
        "learn1": "Core Vue.js Concepts – Directives, Templating, and Data Binding",
        "learn2": "Working with Vue CLI and Project Structure",
        "learn3": "Creating and Managing Components",
        "learn4": "Passing Data with Props and Emitting Events",
        "learn5": "Using Computed Properties and Watchers",
        "learn6": "State Management with Vue's Reactive System",
        "learn7": "Building Projects like To-Do List, Weather App, and Blog",
        "learn8": "Form Handling and Validation",
        "learn9": "Routing with Vue Router for SPA Navigation",
        "learn10": "Vue Lifecycle Hooks and Performance Tips",
        "learn11": "Deploying Vue Apps on Netlify and GitHub Pages",
        "learn12": "Introduction to Vue DevTools and Debugging Techniques",
        "duration":"3 Months"


    },
    {
        "id": 10,
        "logo": "course_thumb07.jpg",
        "courseTitle": "Bootstrap 5 and Material UI with React Integration",
        "category": "Frontend",
        "instructor": "Oawe Alve",
        "price": "premium",
        "language": "spanish",
        "difficulty": "expert",
        "rating": "expert",
        "duration":"6 Months",
        "decription1":"Learn how to design responsive and modern web interfaces using Bootstrap 5 and Material UI integrated with React at KP Technologies. This course is ideal for frontend developers, UI designers, and beginners who want to master UI frameworks in React-based applications. You'll start with styling basics and progress to component customization and responsive layouts.","decription3":"Through practical projects like Dashboards, Portfolios, Product Pages, and Admin Panels, you’ll gain hands-on experience with Bootstrap grids, utility classes, and React-Bootstrap components, along with Material UI themes, typography, buttons, modals, and dynamic theming. The course focuses on building sleek, consistent, and responsive UIs efficiently.","decription4":"At KP Technologies, this UI-focused course includes expert guidance, real-time projects, and career support. In just 3 months, you’ll learn to create production-grade frontends using Bootstrap 5 and Material UI in React apps. Whether you're aiming to boost your design skills or prepare for frontend roles, this course will help you stand out.","learn1":"Fundamentals of Bootstrap 5 and Material UI","learn2":"Setting up Bootstrap and MUI in React Projects","learn3":"Using Bootstrap Grid System and Flex Utilities","learn4":"Creating Reusable Components with React-Bootstrap","learn5":"Customizing Themes and Typography in Material UI","learn6":"Working with MUI Components – Buttons, Cards, Dialogs","learn7":"Responsive Design with Media Queries and Breakpoints","learn8":"Building Real Projects like Dashboards and Product Pages","learn9":"Integrating Forms and Validations using Bootstrap and MUI","learn10":"Dark Mode and Theming with Material UI","learn11":"Optimizing Layouts for Mobile and Desktop Views","learn12":"Deploying UI Projects to GitHub Pages or Netlify"
    },
    {
        "id": 11,
        "logo": "course_thumb08.jpg",
        "courseTitle": "Mastering Node.js: Build Scalable Backend Applications",
        "category": "Backend",
        "instructor": "Liakon Rivey",
        "price": "premium",
        "language": "china",
        "difficulty": "beginner",
        "rating": "beginner",
        "decription1":"Master backend development with Node.js at KP Technologies. This course is perfect for students, backend developers, and professionals who want to build scalable, high-performance server-side applications using JavaScript. You’ll start from the basics of Node.js and progressively dive into advanced topics like Express.js, RESTful APIs, authentication, and databases.","decription3":"Through project-based learning, you'll build real-world applications such as a REST API, User Authentication System, Blogging Platform, and E-commerce Backend. The course covers core Node.js modules, middleware, routing, environment configuration, and database integration using MongoDB and Mongoose.","decription4":"At KP Technologies, the Node.js course includes live projects, expert mentorship, and career guidance. In just 3 months, you’ll become proficient in developing, testing, and deploying production-ready backend applications with Node.js. Whether you aim for a backend developer role or full-stack position, this course will boost your profile.","learn1":"Core Concepts of Node.js – Event Loop, Modules, and Streams","learn2":"Building and Structuring Node.js Projects","learn3":"Creating RESTful APIs with Express.js","learn4":"Routing, Middleware, and Error Handling","learn5":"Integrating MongoDB using Mongoose","learn6":"Authentication and Authorization using JWT","learn7":"Environment Variables and Secure Config Setup","learn8":"Building Real Projects like Blog and E-commerce Backend","learn9":"File Uploads and Data Validation","learn10":"Testing APIs using Postman and Writing Unit Tests","learn11":"Performance Optimization and Logging","learn12":"Deploying Node.js Apps on Render, Railway, or VPS",
        "duration":"3 Months"
    },
    {
        "id": 12,
        "logo": "course_thumb09.jpg",
        "courseTitle": "RESTful APIs with Express.js and MongoDB",
        "category": "Backend",
        "instructor": "Foley Patrik",
        "price": "free",
        "language": "spanish",
        "difficulty": "intermediate",
        "rating": "intermediate",
        "decription1":"Learn to build powerful and secure RESTful APIs using Express.js and MongoDB at KP Technologies. This course is ideal for backend developers, full-stack learners, and students who want to understand how modern APIs are built, connected, and consumed. Starting with REST principles, you'll advance to building full API layers with real-world use cases.","decription3":"Using hands-on projects like a Task Manager API, Blog API, and E-commerce Backend, you’ll learn how to structure API endpoints, connect with MongoDB, handle CRUD operations, apply middleware, and implement user authentication. The course focuses on Express routing, Mongoose models, error handling, and API testing.","decription4":"At KP Technologies, this API-focused course comes with live project work, experienced mentors, and placement assistance. In just 3 months, you’ll become confident in designing, building, and deploying scalable RESTful APIs using Express.js and MongoDB. Ideal for backend roles or full-stack positions.","learn1":"Understanding REST Architecture and API Principles","learn2":"Setting up Express.js Project with Node.js","learn3":"Creating CRUD APIs and Route Handling","learn4":"Connecting MongoDB with Mongoose","learn5":"Modeling Data and Using Schemas","learn6":"Implementing Middleware for Validation and Security","learn7":"Authentication using JWT and Role-Based Access","learn8":"Building Real-World APIs like Task Manager and Blog","learn9":"Handling Errors and Status Codes Properly","learn10":"API Testing using Postman and Thunder Client","learn11":"Pagination, Sorting, and Filtering in APIs","learn12":"Deploying APIs to Render, Railway, or VPS",
        "duration":"3 Months"

    },
    {
        "id": 13,
        "logo": "course_thumb10.jpg",
        "courseTitle": "Build Secure APIs with ASP.NET Core Web API",
        "category": "Backend",
        "instructor": "Jackson Alive",
        "price": "premium",
        "language": "china",
        "difficulty": "china",
        "rating": "china",
        "duration":"6 Months",
        "decription1":"Learn to build secure and scalable RESTful APIs using ASP.NET Core Web API at KP Technologies. This course is perfect for backend developers, .NET professionals, and students who want to master modern API development with C#. Starting from the basics, you'll dive into controller creation, routing, data access, and security implementation.","decription3":"Through real-world projects like User Management API, Product Catalog API, and Authenticated Admin Panel, you’ll learn how to use Entity Framework Core, implement JWT-based authentication, apply role-based access, and follow best practices for API versioning, exception handling, and logging.","decription4":"At KP Technologies, our ASP.NET Core API course includes hands-on project building, expert mentorship, and job-focused training. In just 3 months, you’ll be ready to develop, secure, and deploy production-ready APIs using the .NET stack. Ideal for backend or full-stack development career paths.","learn1":"Fundamentals of ASP.NET Core and Web API Architecture","learn2":"Creating Controllers, Routing, and Action Methods","learn3":"Model Binding, Validation, and DTOs","learn4":"Integrating Entity Framework Core and Database Context","learn5":"CRUD Operations and Repository Pattern","learn6":"Implementing Authentication using JWT","learn7":"Role-Based Authorization and Claims","learn8":"Building Real-World APIs like User and Product Services","learn9":"Exception Handling and Global Middleware","learn10":"API Versioning, CORS, and Security Best Practices","learn11":"Unit Testing APIs and Using Swagger for Documentation","learn12":"Deploying ASP.NET Core APIs to IIS, Azure, or VPS"
    },
    {
        "id": 14,
        "logo": "course_thumb10.jpg",
        "courseTitle": "Java Spring Boot Mastery: Build Real World Backend APIs",
        "category": "Backend",
        "instructor": "Jackson Alive",
        "price": "premium",
        "language": "china",
        "difficulty": "china",
        "rating": "china",
        "duration":"6 Months",
       "decription1":"Master backend development with Java and Spring Boot at KP Technologies. This course is ideal for Java developers, backend engineers, and students aiming to build scalable, production-grade RESTful APIs using Spring Boot. You’ll start from the fundamentals and advance to building secure, database-driven APIs with modern Java practices.","decription3":"Through real-world projects like Employee Management System, E-commerce API, and Blog Backend, you’ll learn to work with Spring Boot starters, controllers, JPA repositories, service layers, and database integration with MySQL or PostgreSQL. The course emphasizes layered architecture, exception handling, security, and deployment.","decription4":"At KP Technologies, the Spring Boot course includes hands-on projects, expert mentoring, and job-readiness training. In just 3 months, you’ll gain the skills to build, test, and deploy robust APIs with Spring Boot. Whether you're preparing for a backend role or full-stack development, this course adds solid value to your resume.","learn1":"Core Concepts of Spring Boot and Project Setup","learn2":"Building RESTful APIs with Controllers and Services","learn3":"Working with Spring Data JPA and Hibernate","learn4":"CRUD Operations and DTO Mapping","learn5":"Exception Handling and Global Error Responses","learn6":"Securing APIs with Spring Security and JWT","learn7":"Integrating MySQL or PostgreSQL with Spring Boot","learn8":"Building Real Projects like E-commerce and Blog APIs","learn9":"Pagination, Sorting, and Filtering with JPA","learn10":"Testing APIs using Postman and JUnit","learn11":"API Documentation using Swagger/OpenAPI","learn12":"Deploying Spring Boot Apps to Heroku, AWS, or VPS"
    },
     {
        "id": 15,
        "logo": "course_thumb10.jpg",
        "courseTitle": "Django and DRF: Build Scalable Python Web APIs",
        "category": "Backend",
        "instructor": "Jackson Alive",
        "price": "premium",
        "language": "china",
        "difficulty": "china",
        "rating": "china",
        "duration":"6 Months",
       "decription1":"Learn to build scalable and secure RESTful APIs using Django and Django REST Framework (DRF) at KP Technologies. This course is ideal for Python developers, backend engineers, and students looking to master web API development with Django. Starting with the basics, you’ll advance to authentication, serializers, and real-world API integrations.","decription3":"Through hands-on projects like a Blog API, E-commerce Backend, and User Management System, you’ll learn how to build modular apps using Django’s MVT architecture, create DRF views and viewsets, use serializers, implement authentication, and connect to PostgreSQL or SQLite databases.","decription4":"At KP Technologies, this Django and DRF course includes expert mentorship, live project implementation, and career guidance. In just 3 months, you'll be ready to develop and deploy production-level APIs using Python, Django, and DRF—perfect for backend development or full-stack roles.","learn1":"Django Project Structure and MVT Architecture","learn2":"Creating Models, Views, and Templates in Django","learn3":"Introduction to Django REST Framework (DRF)","learn4":"Building REST APIs with DRF Views and ViewSets","learn5":"Working with Serializers and ModelSerializers","learn6":"CRUD Operations and URL Routing","learn7":"User Authentication using Token and JWT","learn8":"Building Real Projects like Blog and E-commerce APIs","learn9":"Permissions, Throttling, and Filtering","learn10":"Testing APIs using Postman and Django Test Client","learn11":"API Documentation with Swagger and DRF-YASG","learn12":"Deploying Django Apps on Render, Heroku, or VPS"
    },
     {
        "id": 16,
        "logo": "course_thumb10.jpg",
        "courseTitle": "PHP and MySQL: Complete Backend Web Development",
        "category": "Backend",
        "instructor": "Jackson Alive",
        "price": "premium",
        "language": "china",
        "difficulty": "china",
        "rating": "china",
        "duration":"6 Months",
       "decription1":"Master backend web development with PHP and MySQL at KP Technologies. This course is perfect for students, beginners, and aspiring web developers who want to learn how to build dynamic, database-driven websites and web applications using core PHP and MySQL. Starting from syntax basics, you'll progress to building secure, full-featured web apps.","decription3":"With real-world projects like Login Systems, Blog Platforms, and Admin Panels, you'll learn to handle form data, validate inputs, use sessions, interact with MySQL databases, and build CRUD functionality. The course also covers structured PHP coding, error handling, and deploying your PHP projects online.","decription4":"At KP Technologies, our PHP and MySQL course features hands-on project building, expert-led mentorship, and placement guidance. In just 3 months, you'll be capable of developing and deploying backend applications with core PHP and MySQL—ideal for freelance work, internships, or junior developer roles.","learn1":"Core PHP Syntax, Variables, and Control Structures","learn2":"Working with Forms, GET and POST Methods","learn3":"PHP Sessions, Cookies, and User Authentication","learn4":"Connecting to MySQL Database using MySQLi or PDO","learn5":"Creating and Managing Databases and Tables","learn6":"Building CRUD Operations with PHP and MySQL","learn7":"Validating and Sanitizing User Input","learn8":"Building Real Projects like Blog, Login System, and CMS","learn9":"Using Functions, Includes, and File Handling","learn10":"Error Handling and Debugging Techniques","learn11":"Securing PHP Applications from SQL Injection","learn12":"Deploying PHP Projects on cPanel or VPS Hosting"
    },
    {
        "id": 17,
        "logo": "course_thumb10.jpg",
        "courseTitle": "Mastering SQL with MySQL and PostgreSQL from Scratch",
        "category": "Database",
        "instructor": "Jackson Alive",
        "price": "premium",
        "language": "china",
        "difficulty": "china",
        "rating": "china",
        "duration":"6 Months",
        "decription1":"Master the fundamentals and advanced concepts of SQL using MySQL and PostgreSQL at KP Technologies. This course is ideal for students, data analysts, backend developers, and anyone looking to understand how to work with relational databases efficiently. You’ll start from basic queries and progress to advanced data manipulation, joins, and optimization techniques.","decription3":"Through practical examples and projects, you’ll learn how to write queries, manage tables, perform joins, group data, use subqueries, and apply functions. The course includes hands-on work with both MySQL and PostgreSQL, giving you cross-platform expertise and exposure to real-world data scenarios.","decription4":"At KP Technologies, this SQL course comes with expert guidance, real-time query building practice, and placement support. In just 3 months, you'll gain confidence to handle data in professional environments using MySQL and PostgreSQL—whether you're aiming for database roles, full-stack development, or data analytics.","learn1":"Introduction to Databases, Tables, and SQL Syntax","learn2":"Creating, Altering, and Dropping Tables","learn3":"Inserting, Updating, and Deleting Records","learn4":"Understanding Data Types and Constraints","learn5":"Using SELECT, WHERE, ORDER BY, and LIMIT Clauses","learn6":"Mastering Joins – INNER, LEFT, RIGHT, FULL","learn7":"Using GROUP BY, HAVING, and Aggregate Functions","learn8":"Working with Subqueries and Nested SELECTs","learn9":"Views, Indexes, and Stored Procedures","learn10":"Data Backup, Restore, and Import/Export","learn11":"Optimizing Queries and Understanding Execution Plans","learn12":"Working with MySQL Workbench and pgAdmin Tools"
        },
        {
        "id": 18,
        "logo": "course_thumb10.jpg",
        "courseTitle": "MongoDB Essentials: Build Scalable NoSQL Databases",
        "category": "Database",
        "instructor": "Jackson Alive",
        "price": "premium",
        "language": "china",
        "difficulty": "china",
        "rating": "china",
        "duration":"6 Months",
       "decription1":"Learn how to build and manage scalable NoSQL databases using MongoDB at KP Technologies. This course is ideal for backend developers, full-stack engineers, and data enthusiasts who want to master document-oriented databases. Starting from the basics of collections and documents, you'll progress to advanced queries, indexing, and aggregation.","decription3":"Through real-world projects like Inventory Management, User Profiles, and Product Catalog APIs, you’ll gain hands-on experience with CRUD operations, schema design, data modeling, indexing, aggregation pipelines, and integrating MongoDB with Node.js or Python. You'll also learn how to handle performance and scaling.","decription4":"At KP Technologies, the MongoDB course includes live projects, expert mentorship, and placement assistance. In just 3 months, you'll be able to design, query, and manage robust MongoDB databases—ideal for NoSQL backend roles, full-stack projects, or data-driven applications.","learn1":"Core Concepts of MongoDB – Documents and Collections","learn2":"Installing MongoDB and Using MongoDB Compass","learn3":"Performing CRUD Operations in MongoDB","learn4":"Designing Schemas and Data Modeling Strategies","learn5":"Working with Embedded and Referenced Documents","learn6":"Writing Advanced Queries using Operators and Filters","learn7":"Using Indexes for Performance Optimization","learn8":"Building Aggregation Pipelines for Complex Data Analysis","learn9":"Integrating MongoDB with Node.js using Mongoose","learn10":"Data Validation, Schema Constraints, and Relationships","learn11":"Database Backup, Restore, and Security Best Practices","learn12":"Deploying MongoDB on Atlas and Connecting via Cloud"
        },
          {
        "id": 19,
        "logo": "course_thumb10.jpg",
        "courseTitle": "Figma UI/UX Design Masterclass: Websites & Apps",
        "category": "Designing (UI/UX)",
        "instructor": "Jackson Alive",
        "price": "premium",
        "language": "china",
        "difficulty": "china",
        "rating": "china",
        "duration":"6 Months",
        "decription1":"Learn how to design stunning user interfaces and seamless user experiences using Figma at KP Technologies. This course is perfect for aspiring UI/UX designers, front-end developers, and product creators who want to master modern design workflows. You’ll start with layout basics and progress to creating interactive, responsive web and mobile app designs.","decription3":"Through hands-on projects like landing pages, dashboards, and mobile screens, you’ll learn design thinking, wireframing, prototyping, UI kits, typography, color theory, and responsive layout techniques. You’ll also collaborate on real-time design files and prepare assets for handoff to developers.","decription4":"At KP Technologies, our Figma UI/UX course includes expert mentorship, portfolio projects, and career guidance. In just 3 months, you’ll be ready to design beautiful, functional products that meet real-world needs—ideal for freelance design, startup projects, or joining a professional UI/UX team.","learn1":"Figma Interface, Tools, and Shortcuts","learn2":"Designing Layouts with Frames, Grids, and Constraints","learn3":"Typography, Colors, Icons, and Style Guides","learn4":"Creating Components and Using Variants","learn5":"Wireframing and Designing Low/High-Fidelity Prototypes","learn6":"Creating Responsive Web and Mobile Layouts","learn7":"Interactive Prototyping and Smart Animations","learn8":"UI Kits, Design Systems, and Asset Reuse","learn9":"Collaboration, Feedback, and Developer Handoff","learn10":"Exporting Assets and Working with Dev Tools","learn11":"Design Thinking and User-Centered Design Principles","learn12":"Building a Professional UI/UX Portfolio with Case Studies"
        },
         {
        "id": 20,
        "logo": "course_thumb10.jpg",
        "courseTitle": "Adobe XD for UI/UX Designers: Prototypes and Wireframes",
        "category": "Designing (UI/UX)",
        "instructor": "Jackson Alive",
        "price": "premium",
        "language": "china",
        "difficulty": "china",
        "rating": "china",
        "duration":"6 Months",
        "decription1":"Master the art of designing interactive wireframes and high-fidelity prototypes using Adobe XD at KP Technologies. This course is tailored for aspiring UI/UX designers, front-end developers, and product teams who want to create professional web and mobile app designs with ease and precision.","decription3":"Through practical projects like portfolio websites, admin panels, and mobile interfaces, you'll learn wireframing, layout design, reusable components, prototyping, transitions, and asset export. You'll also explore Adobe XD’s collaboration tools and best practices for developer handoff.","decription4":"At KP Technologies, our Adobe XD course offers real-world projects, expert guidance, and placement support. Within 3 months, you'll be confident in using Adobe XD to build clean, modern, user-friendly interfaces and complete clickable prototypes for client and product teams.","learn1":"Getting Started with Adobe XD Interface and Tools","learn2":"Creating Artboards for Web and Mobile Designs","learn3":"Designing Wireframes and Low-Fidelity Mockups","learn4":"Working with Grids, Layouts, and Responsive Resizing","learn5":"Creating and Reusing Components and Symbols","learn6":"Building Interactive Prototypes and Clickable Demos","learn7":"Designing UI Elements: Buttons, Inputs, Cards, and Menus","learn8":"Using Auto-Animate and Transition Effects","learn9":"Collaborating on Designs and Sharing Links","learn10":"Exporting Assets and Developer Handoff","learn11":"Integrating Adobe XD with Photoshop and Illustrator","learn12":"Building a Portfolio with Real Client UI/UX Projects"
        },
         {
        "id": 21,
        "logo": "course_thumb10.jpg",
        "courseTitle": "React Native for iOS & Android with Live Projects",
        "category": "Mobile",
        "instructor": "Jackson Alive",
        "price": "premium",
        "language": "china",
        "difficulty": "china",
        "rating": "china",
        "duration":"6 Months",
        "decription1":"Learn to build cross-platform mobile apps using React Native at KP Technologies. This course is ideal for JavaScript developers, mobile enthusiasts, and students who want to create real iOS and Android apps from a single codebase. You’ll start with React Native setup and build interactive user interfaces using native components.","decription3":"With project-based learning, you’ll build apps like a To-Do Manager, Chat App, and E-commerce Mobile Store. You’ll explore navigation, API integration, state management, animations, and native device access (camera, storage, notifications). You'll also learn debugging and performance optimization for real-world mobile apps.","decription4":"At KP Technologies, our React Native course includes hands-on projects, mentor support, and placement assistance. In just 3 months, you'll be capable of developing and publishing mobile apps to Play Store and App Store using React Native and Expo.","learn1":"Setting up React Native with Expo and CLI","learn2":"Understanding Components, Props, and State","learn3":"Navigation using React Navigation","learn4":"State Management with Context API and Redux","learn5":"API Calls with Fetch and Axios","learn6":"Form Handling and Input Validations","learn7":"Using Native Device Features: Camera, Location, Notifications","learn8":"Animations and UI Interactions","learn9":"Building Real-World Apps like Chat & E-commerce","learn10":"Debugging and Performance Tuning","learn11":"Publishing Apps to Google Play Store and Apple App Store","learn12":"Best Practices and Code Structure for Scalable Mobile Apps"
        },
         {
        "id": 22,
        "logo": "course_thumb10.jpg",
        "courseTitle": "Flutter & Dart Mastery: Cross-Platform App Development",
        "category": "Mobile",
        "instructor": "Jackson Alive",
        "price": "premium",
        "language": "china",
        "difficulty": "china",
        "rating": "china",
        "duration":"6 Months",
        "decription1":"Master Flutter and Dart to build beautiful, high-performance mobile apps for Android and iOS at KP Technologies. This course is ideal for developers, students, and tech enthusiasts who want to learn Google's powerful UI toolkit for cross-platform app development using a single codebase.","decription3":"Through hands-on projects like Task Manager, E-commerce App, and Chat App, you will learn Dart fundamentals, Flutter widgets, layouts, navigation, state management with Provider or Riverpod, and API integration. You'll also explore animations, Firebase integration, and app deployment.","decription4":"At KP Technologies, this 3-month course includes real projects, expert mentoring, and placement support. You'll gain the skills to build, test, and publish stunning Flutter apps on Google Play and the App Store, ready for freelance or professional development roles.","learn1":"Dart Programming Basics and OOP Concepts","learn2":"Flutter Project Structure and Setup","learn3":"Working with Stateless and Stateful Widgets","learn4":"Layouts and UI Design with Rows, Columns, and Containers","learn5":"Navigation and Route Management","learn6":"Forms, Input Validation, and User Interaction","learn7":"State Management using Provider or Riverpod","learn8":"REST API Integration and JSON Parsing","learn9":"Firebase Authentication and Firestore Database","learn10":"Animations and Gesture Detection","learn11":"App Testing and Debugging","learn12":"Building and Publishing Apps to Play Store and App Store"
        },
         {
        "id": 23,
        "logo": "course_thumb10.jpg",
        "courseTitle": "Kotlin Android Development Bootcamp for Beginners",
        "category": "Mobile",
        "instructor": "Jackson Alive",
        "price": "premium",
        "language": "china",
        "difficulty": "china",
        "rating": "china",
        "duration":"6 Months",
        "decription1":"Kickstart your Android development journey with Kotlin at KP Technologies. This beginner-friendly course is perfect for students, aspiring mobile developers, and Java programmers looking to transition to modern Android development using Kotlin and Android Studio.","decription3":"You’ll build real apps like Notes App, Calculator, and Weather App while learning core Android concepts including UI components, activity lifecycle, intents, RecyclerViews, Room database, and API integration. The course emphasizes Kotlin syntax, object-oriented programming, and Android Jetpack components.","decription4":"In just 3 months, you’ll gain hands-on experience, expert guidance, and project-based learning. KP Technologies offers mentorship and placement assistance to help you become job-ready in Android app development using Kotlin.","learn1":"Setting Up Android Studio and Kotlin Environment","learn2":"Kotlin Syntax, Functions, Classes, and OOP","learn3":"Understanding Activities and Lifecycle","learn4":"Working with Intents and Navigation","learn5":"Designing Layouts using XML and Material Design","learn6":"User Input, Forms, and Validation","learn7":"RecyclerView and List Management","learn8":"Local Data Storage with Room Database","learn9":"Fetching Data from REST APIs using Retrofit","learn10":"Notifications and Background Tasks","learn11":"Debugging and App Testing","learn12":"Publishing Android Apps on Google Play Store"
        },
         {
        "id": 24,
        "logo": "course_thumb10.jpg",
        "courseTitle": "MERN Stack: MongoDB, Express, React & Node",
        "category": "FullStack",
        "instructor": "Jackson Alive",
        "price": "premium",
        "language": "china",
        "difficulty": "china",
        "rating": "china",
        "duration":"6 Months",
        "decription1":"Master full-stack web development using the MERN stack—MongoDB, Express.js, React.js, and Node.js—at KP Technologies. This 3-month course is perfect for developers looking to build dynamic, data-driven web applications from scratch with a unified JavaScript tech stack.","decription3":"You’ll create real-world projects like Task Manager, E-commerce Site, and Social Media App while learning backend APIs with Node.js & Express, frontend interfaces with React, and NoSQL data modeling with MongoDB. The course also covers JWT authentication, deployment, and version control.","decription4":"Get hands-on training, expert mentorship, and placement support at KP Technologies. By the end of this course, you'll be ready to launch scalable full-stack applications, work as a MERN developer, or build freelance projects confidently.","learn1":"Fundamentals of JavaScript and Node.js","learn2":"Building RESTful APIs with Express.js","learn3":"NoSQL Database Design with MongoDB","learn4":"Frontend Development with React.js","learn5":"State Management with Context API or Redux","learn6":"Routing with Express and React Router","learn7":"User Authentication with JWT","learn8":"Form Handling and Input Validation","learn9":"CRUD Operations across Full Stack","learn10":"Version Control with Git and GitHub","learn11":"Connecting Frontend and Backend Seamlessly","learn12":"Deployment with Render, Vercel, or Netlify"
        },
         {
        "id": 25,
        "logo": "course_thumb10.jpg",
        "courseTitle": "MEAN Stack Developer Bootcamp: Angular & Node.js",
        "category": "FullStack",
        "instructor": "Jackson Alive",
        "price": "premium",
        "language": "china",
        "difficulty": "china",
        "rating": "china",
        "duration":"6 Months",
        "decription1":"Become a professional MEAN Stack Developer by mastering MongoDB, Express.js, Angular, and Node.js in this 3-month bootcamp at KP Technologies. This course is designed for aspiring full-stack developers who want to build dynamic, data-driven web applications with a TypeScript-based frontend.","decription3":"You’ll develop real-world apps such as a CRM System, Admin Dashboard, and Blog Platform while learning Angular components, services, forms, and routing along with backend development using Node.js and Express.js and MongoDB for database management.","decription4":"Get expert mentorship, hands-on project experience, and placement support. By the end of this course, you’ll be equipped to build production-ready MEAN stack applications and secure job roles in full-stack development.","learn1":"Introduction to Angular and TypeScript","learn2":"Angular Components, Modules, and Routing","learn3":"Form Handling and Angular Services","learn4":"RESTful APIs with Node.js and Express.js","learn5":"MongoDB Database Integration","learn6":"Two-Way Data Binding in Angular","learn7":"User Authentication with JWT","learn8":"CRUD Operations in Full Stack","learn9":"Error Handling and Validation","learn10":"Angular HTTP Client and Observables","learn11":"Deploying Full-Stack Apps","learn12":"Version Control and GitHub Collaboration"
        },
         {
        "id": 26,
        "logo": "course_thumb10.jpg",
        "courseTitle": ".NET Full Stack: ASP.NET Core + Angular + SQL Server",
        "category": "FullStack",
        "instructor": "Jackson Alive",
        "price": "premium",
        "language": "china",
        "difficulty": "china",
        "rating": "china",
        "duration":"6 Months",
        "decription1":"Master full-stack development using ASP.NET Core for the backend, Angular for the frontend, and SQL Server for database management in this comprehensive 3-month program at KP Technologies. Ideal for students and professionals aiming to build enterprise-grade web applications.","decription3":"You’ll work on real-world projects like Inventory Management, Admin Panels, and Online Portals while learning ASP.NET Core Web APIs, Entity Framework Core, Angular components, routing, and database design using SQL Server.","decription4":"With expert mentorship, live coding sessions, and career support, this course prepares you to confidently build scalable, secure, and modern full-stack applications in the Microsoft ecosystem.","learn1":"ASP.NET Core MVC and Web API Development","learn2":"Frontend Development with Angular 17","learn3":"Database Design and Management with SQL Server","learn4":"Entity Framework Core for Data Access","learn5":"Angular Routing, Services, and Forms","learn6":"JWT Authentication and Authorization","learn7":"Implementing CRUD Operations Full Stack","learn8":"Dependency Injection in ASP.NET Core","learn9":"API Integration and Data Binding","learn10":"Project Architecture and Folder Structure","learn11":"Deploying .NET Apps with IIS or Azure","learn12":"Git, GitHub, and Version Control Practices"
        },
         {
        "id": 27,
        "logo": "course_thumb10.jpg",
        "courseTitle": "LAMP Project-Based Course: Linux, Apache, MySQL, PHP",
        "category": "FullStack",
        "instructor": "Jackson Alive",
        "price": "premium",
        "language": "china",
        "difficulty": "china",
        "rating": "china",
        "duration":"6 Months",
        "decription1":"Master full-stack web development with the LAMP stack — Linux, Apache, MySQL, and PHP — in this 3-month hands-on course at KP Technologies. Ideal for beginners and intermediate developers aiming to build dynamic, database-driven websites from scratch.","decription3":"You’ll build real-world web projects like CMS platforms, Job Portals, and Blogging Systems while learning PHP programming, database interaction using MySQL, Apache server setup, and Linux environment configuration.","decription4":"This course offers live project implementation, expert-led sessions, and deployment skills that make you job-ready in the PHP ecosystem. Suitable for freelance developers and students preparing for backend roles.","learn1":"Setting up LAMP Stack on Localhost and Linux","learn2":"Core PHP Programming: Syntax, Loops, Functions","learn3":"Working with Forms, Sessions, and Cookies","learn4":"Database Operations with MySQL","learn5":"CRUD Operations with PHP and MySQL","learn6":"MVC Architecture and Code Reusability","learn7":"Creating Admin Panels and CMS Modules","learn8":"File Uploads, Pagination, and Email Integration","learn9":"Security Best Practices in PHP","learn10":"Deployment on Apache Web Server","learn11":"Linux Terminal and Shell Basics","learn12":"Live Projects with Hosting and Domain Integration"
        },
         {
        "id": 28,
        "logo": "course_thumb10.jpg",
        "courseTitle": "React + Spring Boot Full Stack Java Development",
        "category": "FullStack",
        "instructor": "Jackson Alive",
        "price": "premium",
        "language": "china",
        "difficulty": "china",
        "rating": "china",
        "duration":"6 Months",
       "decription1":"Become a full stack developer by mastering React.js for the frontend and Spring Boot for the backend in this 3-month project-driven course at KP Technologies. Ideal for students and professionals who want to build enterprise-grade Java web applications.","decription3":"You'll develop real-world apps like Employee Management Systems and E-commerce Dashboards, learning REST API development with Spring Boot, JPA/Hibernate, frontend integration using React, and deployment practices.","decription4":"With expert guidance, hands-on projects, and placement support, you'll gain the skills to confidently develop full-stack Java applications using modern tools and frameworks.","learn1":"Frontend Development with React – Components, Props, and State","learn2":"Spring Boot Backend Development with Java","learn3":"Building REST APIs with Spring MVC","learn4":"Database Integration using JPA and Hibernate","learn5":"Connecting React Frontend to Spring Boot APIs","learn6":"Form Handling and Validation in React","learn7":"Spring Security for Authentication and Authorization","learn8":"Axios or Fetch API Integration in React","learn9":"CRUD Operations Across Full Stack","learn10":"Project Structure and Best Practices","learn11":"MySQL or PostgreSQL Database Setup","learn12":"Deploying Full Stack Apps to Heroku or AWS"
        },
         {
        "id": 29,
        "logo": "course_thumb10.jpg",
        "courseTitle": "Python Django + React Full Stack Web Development",
        "category": "FullStack",
        "instructor": "Jackson Alive",
        "price": "premium",
        "language": "china",
        "difficulty": "china",
        "rating": "china",
        "duration":"6 Months",
        "decription1":"Master full stack development using Django for the backend and React.js for the frontend in this 3-month intensive course at KP Technologies. Perfect for students and professionals aiming to build modern, scalable web applications.","decription3":"You’ll build real-world projects like Task Managers and E-commerce Platforms by combining Django REST Framework with React components, learning API development, JWT authentication, and seamless frontend-backend integration.","decription4":"With live project experience, expert mentorship, and job-oriented training, you’ll be prepared to build and deploy full stack web apps using Python and React for production environments.","learn1":"React.js Fundamentals – Components, Hooks, and Routing","learn2":"Django Basics – Models, Views, and Templates","learn3":"Django REST Framework (DRF) for API Development","learn4":"Integrating React Frontend with Django Backend","learn5":"JWT Authentication and User Login Systems","learn6":"CRUD Operations in Full Stack","learn7":"Working with PostgreSQL or SQLite","learn8":"Form Handling and Data Validation in React","learn9":"Serializers and Permissions in Django REST Framework","learn10":"Reusable React Components and State Management","learn11":"Deploying Django + React Apps on Render or Heroku","learn12":"Best Practices for Full Stack Project Structure"
        },
         {
        "id": 30,
        "logo": "course_thumb10.jpg",
        "courseTitle": "Full Stack Web Dev with Vue.js, Node, and Firebase",
        "category": "FullStack",
        "instructor": "Jackson Alive",
        "price": "premium",
        "language": "china",
        "difficulty": "china",
        "rating": "china",
        "duration":"6 Months",
        "decription1":"Learn to build powerful full stack web applications using Vue.js for the frontend, Node.js for server-side logic, and Firebase for backend services in this hands-on 3-month course at KP Technologies.","decription3":"Through real projects like Chat Apps and E-commerce platforms, you’ll master Vue components, Node.js APIs, Firebase Authentication, Firestore database, and cloud functions integration.","decription4":"This course provides expert guidance, project-based learning, and placement support to make you confident in developing and deploying modern full stack applications with Vue, Node, and Firebase.","learn1":"Vue.js Basics – Components, Directives, and Routing","learn2":"State Management using Vuex","learn3":"Form Handling and Validation in Vue","learn4":"Creating REST APIs with Node.js and Express","learn5":"Integrating Firebase Authentication","learn6":"Real-Time Database with Firestore","learn7":"Cloud Functions for Serverless Logic","learn8":"Connecting Vue Frontend with Node/Firebase Backend","learn9":"CRUD Operations in Full Stack","learn10":"Firebase Hosting and Deployment","learn11":"Authentication Guards in Vue Router","learn12":"Best Practices for Structuring Full Stack Projects"
        },
          {
        "id": 31,
        "logo": "course_thumb10.jpg",
        "courseTitle": "Full Stack Development: Spring Boot, Hibernate & Angular",
        "category": "FullStack",
        "instructor": "Jackson Alive",
        "price": "premium",
        "language": "china",
        "difficulty": "china",
        "rating": "china",
        "duration":"6 Months",
       "decription1":"Become a full stack developer by mastering Spring Boot, Hibernate, and Angular in this intensive 3-month course at KP Technologies. Learn to build scalable enterprise-grade applications with end-to-end architecture.","decription3":"Through hands-on projects like Employee Management Systems and Online Portals, you’ll integrate Angular frontends with REST APIs built using Spring Boot and Hibernate for robust backend data handling.","decription4":"This course includes expert mentorship, real-time project development, and placement assistance to help you launch a career in full stack Java development with modern tools and best practices.","learn1":"Angular Fundamentals – Components, Services, and Routing","learn2":"Form Handling and Reactive Forms in Angular","learn3":"Spring Boot for Building RESTful APIs","learn4":"Database Integration using Hibernate ORM","learn5":"JPA and Entity Relationships","learn6":"CRUD Operations with Angular and Spring Boot","learn7":"Authentication and Role-Based Access Control","learn8":"Connecting Angular Frontend with Spring Boot Backend","learn9":"Global Exception Handling in Spring Boot","learn10":"Pagination and Sorting in APIs","learn11":"Project Deployment with Spring Boot and Angular","learn12":"Best Practices for Full Stack Java Development"
        }
]